GHB2/src/Documents/гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации/гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации</name>
  <registerRecords>InformationRegister.гхб_ПраваЗаездаНаТерриториюЛокации</registerRecords>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникиКраткийСостав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
        <types>CatalogRef.гхб_ПрочиеФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньДолжности</name>
      <type>
        <types>EnumRef.гхб_УровниДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипАвтомобиля</name>
      <type>
        <types>EnumRef.гхб_ТипАвтомобиляСлужебныйПерсональный</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.гхб_Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПропуска</name>
      <type>
        <types>EnumRef.гхб_ВидПропускаПарковочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперации</name>
      <type>
        <types>EnumRef.гхб_ТипОперацииЗакреплениеОткреплениеПарковочногоМеста</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_ПраваЗаездаНаТерриториюЛокации/гхб_ПраваЗаездаНаТерриториюЛокации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ПраваЗаездаНаТерриториюЛокации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ВидПропуска</name>
    <type>
      <types>EnumRef.гхб_ВидПропускаПарковочныеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.гхб_ТипОперацииЗакреплениеОткреплениеПарковочногоМеста</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФИО</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
      <types>CatalogRef.гхб_ПрочиеФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.гхб_Автомобили</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Documents/гхб_ЗакреплениеПраваЗаездаНаТерриториюЛокации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	СотрудникиКраткийСостав = "";
	
	_ТЗ = Данные.Выгрузить(, "ФИО");
	_ТЗ.Свернуть("ФИО");
	_ТЗ.Сортировать("ФИО");
	
	Для Каждого Стр Из _ТЗ Цикл
		СотрудникиКраткийСостав = СотрудникиКраткийСостав + ?(ЗначениеЗаполнено(СотрудникиКраткийСостав), "; ", "") +
			ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Стр.ФИО));
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияПоЗакреплениюСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоЗакреплениюСотрудников()
	
	Для Каждого Стр Из Данные Цикл
	
		_Строка = Движения.гхб_ПраваЗаездаНаТерриториюЛокации.Добавить();
		_Строка.Период = Дата;
		_Строка.Регистратор = Ссылка;
		_Строка.Локация = Локация;
		_Строка.ФИО = Стр.ФИО;
		_Строка.Автомобиль = Стр.Автомобиль;
		_Строка.ВидПропуска = Стр.ВидПропуска;
		_Строка.ДатаНачалаДействия = Стр.ДатаНачалаДействия;
		_Строка.ДатаОкончанияДействия = Стр.ДатаОкончанияДействия;
		_Строка.ТипОперации = Стр.ТипОперации;
	
	КонецЦикла;

	Движения.гхб_ПраваЗаездаНаТерриториюЛокации.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
